Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM2532LS00048.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4000102C"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DFLLCTRL" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnn-" edc:por="0000000010000000" edc:mclr="0000000010000000" edc:impl="0xFFE" edc:_addr="0x40001030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="DFLL Enable"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x1" edc:desc="Operating Mode Selection"/>
            <edc:SFRFieldDef edc:cname="STABLE" edc:nzwidth="0x1" edc:desc="Stable DFLL Frequency"/>
            <edc:SFRFieldDef edc:cname="LLAW" edc:nzwidth="0x1" edc:desc="Lose Lock After Wake"/>
            <edc:SFRFieldDef edc:cname="USBCRM" edc:nzwidth="0x1" edc:desc="USB Clock Recovery Mode"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="CCDIS" edc:nzwidth="0x1" edc:desc="Chill Cycle Disable"/>
            <edc:SFRFieldDef edc:cname="QLDIS" edc:nzwidth="0x1" edc:desc="Quick Lock Disable"/>
            <edc:SFRFieldDef edc:cname="BPLCKC" edc:nzwidth="0x1" edc:desc="Bypass Coarse Lock"/>
            <edc:SFRFieldDef edc:cname="WAITLOCK" edc:nzwidth="0x1" edc:desc="Wait Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x40001032"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DFLLVAL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40001034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FINE" edc:nzwidth="0xA" edc:desc="Fine Value"/>
            <edc:SFRFieldDef edc:cname="COARSE" edc:nzwidth="0x6" edc:desc="Coarse Value"/>
            <edc:SFRFieldDef edc:cname="DIFF" edc:nzwidth="0x10" edc:desc="Multiplication Ratio Difference"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DFLLMUL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40001038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="MUL" edc:nzwidth="0x10" edc:desc="DFLL Multiply Factor"/>
            <edc:SFRFieldDef edc:cname="FSTEP" edc:nzwidth="0xA" edc:desc="Fine Maximum Step"/>
            <edc:SFRFieldDef edc:cname="CSTEP" edc:nzwidth="0x6" edc:desc="Coarse Maximum Step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DFLLSYNC" edc:nzwidth="0x8" edc:access="n-------" edc:por="00000000" edc:mclr="00000000" edc:impl="0x80" edc:_addr="0x4000103C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="READREQ" edc:nzwidth="0x1" edc:desc="Read Request"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x4000103D"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLLCTRLA" edc:nzwidth="0x8" edc:access="nn----n-" edc:por="10000000" edc:mclr="10000000" edc:impl="0xC2" edc:_addr="0x40001040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="DPLL Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Clock Activation"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40001041"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLLRATIO" edc:nzwidth="0x20" edc:access="------------nnnn----nnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0FFF" edc:_addr="0x40001044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LDR" edc:nzwidth="0xC" edc:desc="Loop Divider Ratio"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LDRFRAC" edc:nzwidth="0x4" edc:desc="Loop Divider Ratio Fractional Part"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLLCTRLB" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnn---n-nnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FF173F" edc:_addr="0x40001048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FILTER" edc:nzwidth="0x2" edc:desc="Proportional Integral Filter Selection">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default Filter Mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LBFILT" edc:desc="Low Bandwidth Filter" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="HBFILT" edc:desc="High Bandwidth Filter" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HDFILT" edc:desc="High Damping Filter" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPEN" edc:nzwidth="0x1" edc:desc="Low-Power Enable"/>
            <edc:SFRFieldDef edc:cname="WUF" edc:nzwidth="0x1" edc:desc="Wake Up Fast"/>
            <edc:SFRFieldDef edc:cname="REFCLK" edc:nzwidth="0x2" edc:desc="Reference Clock Selection">
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K Clock Reference" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC Clock Reference" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK Clock Reference" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LTIME" edc:nzwidth="0x3" edc:desc="Lock Time">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="No time-out. Automatic lock" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="8MS" edc:desc="Time-out if no lock within 8 ms" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="9MS" edc:desc="Time-out if no lock within 9 ms" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="10MS" edc:desc="Time-out if no lock within 10 ms" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="11MS" edc:desc="Time-out if no lock within 11 ms" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LBYPASS" edc:nzwidth="0x1" edc:desc="Lock Bypass"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0xB" edc:desc="Clock Divider"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLLPRESC" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x4000104C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="PRESC" edc:nzwidth="0x2" edc:desc="Output Clock Prescaler">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="DPLL output is divided by 1" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="DPLL output is divided by 2" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="DPLL output is divided by 4" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x4000104D"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLLSYNCBUSY" edc:nzwidth="0x8" edc:access="----rrr-" edc:por="00000000" edc:mclr="00000000" edc:impl="0xE" edc:_addr="0x40001050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="DPLL Enable Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="DPLLRATIO" edc:nzwidth="0x1" edc:desc="DPLL Loop Divider Ratio Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="DPLLPRESC" edc:nzwidth="0x1" edc:desc="DPLL Prescaler Synchronization Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40001051"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLLSTATUS" edc:nzwidth="0x8" edc:access="------rr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40001054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LOCK" edc:nzwidth="0x1" edc:desc="DPLL Lock"/>
            <edc:SFRFieldDef edc:cname="CLKRDY" edc:nzwidth="0x1" edc:desc="DPLL Clock Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3AB" edc:_addr="0x40001055"/>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="-----------------------------n-n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x5" edc:_addr="0x40001400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:nzwidth="0x1" edc:desc="XOSC32K Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKFAIL" edc:nzwidth="0x1" edc:desc="XOSC32K Clock Failure Detector Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="-----------------------------n-n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x5" edc:_addr="0x40001404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:nzwidth="0x1" edc:desc="XOSC32K Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKFAIL" edc:nzwidth="0x1" edc:desc="XOSC32K Clock Failure Detector Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
