Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM2532LS00048.PIC
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="NONSECUSER1" edc:nzwidth="0x20" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFF" edc:_addr="0x420003E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER32" edc:nzwidth="0x1" edc:desc="Non-Secure for User 32"/>
            <edc:SFRFieldDef edc:cname="USER33" edc:nzwidth="0x1" edc:desc="Non-Secure for User 33"/>
            <edc:SFRFieldDef edc:cname="USER34" edc:nzwidth="0x1" edc:desc="Non-Secure for User 34"/>
            <edc:SFRFieldDef edc:cname="USER35" edc:nzwidth="0x1" edc:desc="Non-Secure for User 35"/>
            <edc:SFRFieldDef edc:cname="USER36" edc:nzwidth="0x1" edc:desc="Non-Secure for User 36"/>
            <edc:SFRFieldDef edc:cname="USER37" edc:nzwidth="0x1" edc:desc="Non-Secure for User 37"/>
            <edc:SFRFieldDef edc:cname="USER38" edc:nzwidth="0x1" edc:desc="Non-Secure for User 38"/>
            <edc:SFRFieldDef edc:cname="USER39" edc:nzwidth="0x1" edc:desc="Non-Secure for User 39"/>
            <edc:SFRFieldDef edc:cname="USER40" edc:nzwidth="0x1" edc:desc="Non-Secure for User 40"/>
            <edc:SFRFieldDef edc:cname="USER41" edc:nzwidth="0x1" edc:desc="Non-Secure for User 41"/>
            <edc:SFRFieldDef edc:cname="USER42" edc:nzwidth="0x1" edc:desc="Non-Secure for User 42"/>
            <edc:SFRFieldDef edc:cname="USER43" edc:nzwidth="0x1" edc:desc="Non-Secure for User 43"/>
            <edc:SFRFieldDef edc:cname="USER44" edc:nzwidth="0x1" edc:desc="Non-Secure for User 44"/>
            <edc:SFRFieldDef edc:cname="USER45" edc:nzwidth="0x1" edc:desc="Non-Secure for User 45"/>
            <edc:SFRFieldDef edc:cname="USER46" edc:nzwidth="0x1" edc:desc="Non-Secure for User 46"/>
            <edc:SFRFieldDef edc:cname="USER47" edc:nzwidth="0x1" edc:desc="Non-Secure for User 47"/>
            <edc:SFRFieldDef edc:cname="USER48" edc:nzwidth="0x1" edc:desc="Non-Secure for User 48"/>
            <edc:SFRFieldDef edc:cname="USER49" edc:nzwidth="0x1" edc:desc="Non-Secure for User 49"/>
            <edc:SFRFieldDef edc:cname="USER50" edc:nzwidth="0x1" edc:desc="Non-Secure for User 50"/>
            <edc:SFRFieldDef edc:cname="USER51" edc:nzwidth="0x1" edc:desc="Non-Secure for User 51"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x420003E8"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="NSCHKUSER0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420003F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER0" edc:nzwidth="0x1" edc:desc="User 0 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER1" edc:nzwidth="0x1" edc:desc="User 1 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER2" edc:nzwidth="0x1" edc:desc="User 2 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER3" edc:nzwidth="0x1" edc:desc="User 3 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER4" edc:nzwidth="0x1" edc:desc="User 4 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER5" edc:nzwidth="0x1" edc:desc="User 5 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER6" edc:nzwidth="0x1" edc:desc="User 6 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER7" edc:nzwidth="0x1" edc:desc="User 7 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER8" edc:nzwidth="0x1" edc:desc="User 8 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER9" edc:nzwidth="0x1" edc:desc="User 9 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER10" edc:nzwidth="0x1" edc:desc="User 10 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER11" edc:nzwidth="0x1" edc:desc="User 11 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER12" edc:nzwidth="0x1" edc:desc="User 12 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER13" edc:nzwidth="0x1" edc:desc="User 13 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER14" edc:nzwidth="0x1" edc:desc="User 14 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER15" edc:nzwidth="0x1" edc:desc="User 15 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER16" edc:nzwidth="0x1" edc:desc="User 16 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER17" edc:nzwidth="0x1" edc:desc="User 17 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER18" edc:nzwidth="0x1" edc:desc="User 18 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER19" edc:nzwidth="0x1" edc:desc="User 19 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER20" edc:nzwidth="0x1" edc:desc="User 20 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER21" edc:nzwidth="0x1" edc:desc="User 21 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER22" edc:nzwidth="0x1" edc:desc="User 22 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER23" edc:nzwidth="0x1" edc:desc="User 23 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER24" edc:nzwidth="0x1" edc:desc="User 24 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER25" edc:nzwidth="0x1" edc:desc="User 25 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER26" edc:nzwidth="0x1" edc:desc="User 26 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER27" edc:nzwidth="0x1" edc:desc="User 27 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER28" edc:nzwidth="0x1" edc:desc="User 28 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER29" edc:nzwidth="0x1" edc:desc="User 29 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER30" edc:nzwidth="0x1" edc:desc="User 30 to be checked as non-secured"/>
            <edc:SFRFieldDef edc:cname="USER31" edc:nzwidth="0x1" edc:desc="User 31 to be checked as non-secured"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
