Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.1.162/PIC32CM-LS00/edc/PIC32CM2532LS00048.PIC
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM122" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM123" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057EC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM124" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM125" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM126" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM127" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:regionid="PPB" edc:beginaddr="0xE0000000" edc:endaddr="0xE002F000" edc:rw="rw">
      <edc:AdjustPoint edc:offset="0x1000" edc:_addr="0xE0000000"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_CTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---nnnnnnnnnnnnn" edc:por="00001011000000000000000000000000" edc:mclr="00001011000000000000000000000000" edc:impl="0xFFFF1FFF" edc:_addr="0xE0001000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="CYCCNTENA" edc:nzwidth="0x1" edc:desc="CYCCNT enable"/>
            <edc:SFRFieldDef edc:cname="POSTPRESET" edc:nzwidth="0x4" edc:desc="POSTCNT preset"/>
            <edc:SFRFieldDef edc:cname="POSTINIT" edc:nzwidth="0x4" edc:desc="POSTCNT initial"/>
            <edc:SFRFieldDef edc:cname="CYCTAP" edc:nzwidth="0x1" edc:desc="Cycle count tap"/>
            <edc:SFRFieldDef edc:cname="SYNCTAP" edc:nzwidth="0x2" edc:desc="Synchronization tap"/>
            <edc:SFRFieldDef edc:cname="PCSAMPLENA" edc:nzwidth="0x1" edc:desc="PC sample enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EXCTRCENA" edc:nzwidth="0x1" edc:desc="Exception trace enable"/>
            <edc:SFRFieldDef edc:cname="CPIEVTENA" edc:nzwidth="0x1" edc:desc="CPI event enable"/>
            <edc:SFRFieldDef edc:cname="EXCEVTENA" edc:nzwidth="0x1" edc:desc="Exception event enable"/>
            <edc:SFRFieldDef edc:cname="SLEEPEVTENA" edc:nzwidth="0x1" edc:desc="Sleep event enable"/>
            <edc:SFRFieldDef edc:cname="LSUEVTENA" edc:nzwidth="0x1" edc:desc="LSU event enable"/>
            <edc:SFRFieldDef edc:cname="FOLDEVTENA" edc:nzwidth="0x1" edc:desc="Fold event enable"/>
            <edc:SFRFieldDef edc:cname="CYCEVTENA" edc:nzwidth="0x1" edc:desc="Cycle event enable"/>
            <edc:SFRFieldDef edc:cname="CYCDISS" edc:nzwidth="0x1" edc:desc="Cycle counter disabled secure"/>
            <edc:SFRFieldDef edc:cname="NOPRFCNT" edc:nzwidth="0x1" edc:desc="No profile counters"/>
            <edc:SFRFieldDef edc:cname="NOCYCCNT" edc:nzwidth="0x1" edc:desc="No cycle count"/>
            <edc:SFRFieldDef edc:cname="NOEXTTRIG" edc:nzwidth="0x1" edc:desc="No external triggers"/>
            <edc:SFRFieldDef edc:cname="NOTRCPKT" edc:nzwidth="0x1" edc:desc="No trace packets"/>
            <edc:SFRFieldDef edc:cname="NUMCOMP" edc:nzwidth="0x4" edc:desc="Number of comparators"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
